IDCloudWrapper/Resources/IDCloud2Images.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
    <soap12:Body>
        <AnalyzeDocumentV2 xmlns="http://IdCloud.iCarVision/WS/">
            <Company>{company}</Company>
            <User>{user}</User>
            <Pwd>{password}</Pwd>
            <GetDocumentIdForMerging>false</GetDocumentIdForMerging>
            <DocInV2>
                <Reference>{reference}</Reference>
                <Image1>
                    <ImageResolution>200</ImageResolution>
                    <Image>{image1Data}</Image>
                    <Filetype>{image1Type}</Filetype>
                </Image1>
                <Image2>
                    <ImageResolution>200</ImageResolution>
                    <Image>{image2Data}</Image>
                    <Filetype>{image2Type}</Filetype>
                </Image2>
                <DocumentIdToMerge />
            </DocInV2>
        </AnalyzeDocumentV2>
    </soap12:Body>
</soap12:Envelope>